SUBJECT_READABLE = {"do": "ДО (Дослідження операцій)", "networks": "Комп’ютерні мережі"}

PRESET_PROMPTS = {
    "short": "Відповідай максимально коротко і додавай 1 приклад.",
    "detailed_step": (
        "Відповідай більш детально, крок за кроком. "
        "Для кожного кроку давай короткий заголовок, пояснення, формули або псевдокод, приклад і потенційні помилки. "
        "Наприкінці — короткий висновок та рекомендації."
    ),
    "detailed_analysis": (
        "Пояснюй дуже детально й аналітично: дай детальний опис, потім альтернативні підходи з порівнянням (плюси/мінуси), "
        "оцінку складності та часу, покрокову реалізацію і приклади коду/розрахунків. Вказуй потенційні помилки."
        "Наприкінці — короткий висновок та рекомендації."
    )
}

lectures = {
    "do": [
        "Лекція 1: Вступ у дослідження операцій",
        "Лекція 2: Лінійне програмування",
        "Лекція 3: Симплекс метод розв’язання задачі лінійного програмування",
        "Лекція 4: Двоїстість у задачах лінійного програмування",
        "Лекція 5: Транспортна задача",
        "Лекція 6: Задачі дискретного програмування",
        "Лекція 7: Методи одновимірної оптимізації",
        "Лекція 8: Нелінійне програмування",
        "Лекція 9: Опукле та квадратичне програмування",
        "Лекція 10: Нелінійне програмування. Методи безумовної оптимізації",
        "Лекція 11: Нелінійне програмування. Методи умовної оптимізації",
        "Лекція 12: Динамічне програмування",
        "Лекція 13: Нелінійне програмування з сепарабельними функціями. Дробово-лінійне програмування",
        "Лекція 14: Чисельні методи розв’язання багатовимірних задач нелінійного програмування за наявності обмежень"
    ],
    "networks": [
        "Лекція 1: Вступ у компʼютерні мережі",
        "Лекція 2: PHY",
        "Лекція 3: DataLink",
        "Лекція 4: MAC",
        "Лекція 5: Ethernet",
        "Лекція 6: WiFi",
        "Лекція 7: Routing",
        "Лекція 8: Internetworking",
        "Лекція 9: IP",
        "Лекція 10: ICMP ARP DHCP",
        "Лекція 11: Transport",
        "Лекція 12: TCP UDP",
        "Лекція 13: DNS EMAIL",
        "Лекція 14: HTTP",
        "Лекція 15: WebAppSec"
    ]
}

SYSTEM_PROMPT_BASE = """
Ти — навчальний помічник для студентів.
Допомагай студентам зі спеціальності "Штучний інтелект".
Відповідай українською, зрозуміло й коректно, структуровано (списки/кроки),
з прикладами за потреби, опираючись на матеріали курсу.
Якщо питання нечітке — коротко уточни.

Предмет: {subject}
Стиль відповіді: {style}
Лекція: {lecture}
"""

GOODBYE_WORDS = {"Допобачення", "До побачення", "Бувай", "Па", "Па-па", "Пока", "Дякую", "Дякую!", "Все, дякую", "зрозуміла, дякую"}